panStamp/panstamp/arduino-1.6/arduino-1.6_patch/mac/tools/msp430/msp430/include/msp430f2416.h
#define RESERVED0_VECTOR    (0x0000)  /* 0xFFC0 Reserved Int. Vector 0 */
#define RESERVED1_VECTOR    (0x0002)  /* 0xFFC2 Reserved Int. Vector 1 */
#define RESERVED2_VECTOR    (0x0004)  /* 0xFFC4 Reserved Int. Vector 2 */
#define RESERVED3_VECTOR    (0x0006)  /* 0xFFC6 Reserved Int. Vector 3 */
#define RESERVED4_VECTOR    (0x0008)  /* 0xFFC8 Reserved Int. Vector 4 */
#define RESERVED5_VECTOR    (0x000A)  /* 0xFFCA Reserved Int. Vector 5 */
#define RESERVED6_VECTOR    (0x000C)  /* 0xFFCC Reserved Int. Vector 6 */
#define RESERVED7_VECTOR    (0x000E)  /* 0xFFCE Reserved Int. Vector 7 */
#define RESERVED8_VECTOR    (0x0010)  /* 0xFFD0 Reserved Int. Vector 8 */
#define RESERVED9_VECTOR    (0x0012)  /* 0xFFD2 Reserved Int. Vector 9 */
#define RESERVED10_VECTOR   (0x0014) /* 0xFFD4 Reserved Int. Vector 10 */
#define RESERVED11_VECTOR   (0x0016) /* 0xFFD6 Reserved Int. Vector 11 */
#define RESERVED12_VECTOR   (0x0018) /* 0xFFD8 Reserved Int. Vector 12 */
#define RESERVED13_VECTOR   (0x001A) /* 0xFFDA Reserved Int. Vector 13 */
#define RESERVED14_VECTOR   (0x001C) /* 0xFFDC Reserved Int. Vector 14 */
#define RESERVED15_VECTOR   (0x001E) /* 0xFFDE Reserved Int. Vector 15 */
#define USCIAB1TX_VECTOR    (0x0020) /* 0xFFE0 USCI A1/B1 Transmit */
#define USCIAB1RX_VECTOR    (0x0022) /* 0xFFE2 USCI A1/B1 Receive */
#define PORT1_VECTOR        (0x0024) /* 0xFFE4 Port 1 */
#define PORT2_VECTOR        (0x0026) /* 0xFFE6 Port 2 */
#define RESERVED20_VECTOR   (0x0028) /* 0xFFE8 Reserved Int. Vector 20 */
#define ADC12_VECTOR        (0x002A) /* 0xFFEA ADC */
#define USCIAB0TX_VECTOR    (0x002C) /* 0xFFEC USCI A0/B0 Transmit */
#define USCIAB0RX_VECTOR    (0x002E) /* 0xFFEE USCI A0/B0 Receive */
#define TIMERA1_VECTOR      (0x0030) /* 0xFFF0 Timer A CC1-2, TA */
#define TIMERA0_VECTOR      (0x0032) /* 0xFFF2 Timer A CC0 */
#define WDT_VECTOR          (0x0034) /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR  (0x0036) /* 0xFFF6 Comparator A */
#define TIMERB1_VECTOR      (0x0038) /* 0xFFF8 Timer B CC1-6, TB */
#define TIMERB0_VECTOR      (0x003A) /* 0xFFFA Timer B CC0 */
#define NMI_VECTOR          (0x003C) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (0x003E) /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430x241x */

